[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|语音记录文本框，但是并没有语音。单击可编辑，按Enter保存。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.9.0

[Variables]
@Include1=#@#GlobalVars.inc


;语音记录文本框
;背景
[VoiceBoxBg]
Meter=Image
SolidColor=#OverlayBGColor#,170
X=8
Y=8
W=500
H=100
LeftMouseUpAction=[!CommandMeasure mVoiceBoxInput "ExecuteBatch 1"]

;文本 ;"现在还不能休息哦。"
[VoiceBoxText]
Meter=String
MeterStyle=styFontTextThin
FontColor=#OverlayFGColor#
FontSize=12
StringAlign=LeftCenter
ClipString=2
Text=#VoiceBoxText#
X=10r
Y=50r
W=480
H=100
DynamicVariables=1

;输入框
[mVoiceBoxInput]
Measure=Plugin
Plugin=InputText
SolidColor=#OverlayBGColor#,200
FontFace=Segoe UI
FontColor=#OverlayFGColor#
FontSize=9
DefaultValue=#VoiceBoxText#
X=[VoiceBoxText:X]
Y=([VoiceBoxText:Y]+8)
W=[VoiceBoxText:W]
H=([VoiceBoxText:H]-16)
Command1=[!WriteKeyValue Variables VoiceBoxText """$UserInput$""" "#@#Settings.ini"][!Refresh]


;左上角标签
[VoiceBoxLabelBg]
Meter=Image
SolidColor=#OverlayFGColor#,120
X=([VoiceBoxBg:X]-4)
Y=([VoiceBoxBg:Y]-2)
W=150
H=15

[VoiceBoxLabel]
Meter=String
MeterStyle=styFontTextThin
FontColor=#OverlayBGColor#,255
FontSize=7
Text=NOTES
X=5r
Y=7r


;下箭头
[VoiceBoxNext]
Meter=Shape
Shape=Path MyPath | StrokeWidth 0 | Fill Color #OverlayFGColor#
MyPath=0,10 | LineTo 20,10 | LineTo 10,20 | LineTo 0,10 | ClosePath 1
X=([VoiceBoxBg:XW]-[VoiceBoxNext:W]-6)
Y=([VoiceBoxBg:YH]-[VoiceBoxNext:H]-6)
DynamicVariables=1